#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.ngc will be created
  + resource "azurerm_kubernetes_cluster" "ngc" {
      + dns_prefix                 = "ngc"
      + enable_pod_security_policy = (known after apply)
      + fqdn                       = (known after apply)
      + id                         = (known after apply)
      + kube_admin_config          = (known after apply)
      + kube_admin_config_raw      = (sensitive value)
      + kube_config                = (known after apply)
      + kube_config_raw            = (sensitive value)
      + kubernetes_version         = (known after apply)
      + location                   = "northeurope"
      + name                       = "ngc"
      + node_resource_group        = (known after apply)
      + resource_group_name        = "ngc"
      + tags                       = (known after apply)

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
            }
        }

      + agent_pool_profile {
          + count           = 3
          + dns_prefix      = (known after apply)
          + fqdn            = (known after apply)
          + max_pods        = (known after apply)
          + name            = "default"
          + os_disk_size_gb = (known after apply)
          + os_type         = "Linux"
          + type            = "AvailabilitySet"
          + vm_size         = "Standard_D2_v2"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = (known after apply)
          + network_plugin     = (known after apply)
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + client_app_id     = (known after apply)
              + server_app_id     = (known after apply)
              + server_app_secret = (sensitive value)
              + tenant_id         = (known after apply)
            }
        }

      + service_principal {
          + client_id     = "5a6f663a-b005-4f4b-88af-ad504dbacd8b"
          + client_secret = (sensitive value)
        }
    }

  # github_repository.repository_api_gateway will be updated in-place
  ~ resource "github_repository" "repository_api_gateway" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for aggregating requests to storage services"
        etag               = "W/\"9b5a99824bc8be9456961f0a413d46c7\""
        full_name          = "NextGenConf/ApiGateway"
        git_clone_url      = "git://github.com/NextGenConf/ApiGateway.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ApiGateway"
        http_clone_url     = "https://github.com/NextGenConf/ApiGateway.git"
        id                 = "ApiGateway"
        license_template   = "mit"
        name               = "ApiGateway"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ApiGateway.git"
        svn_url            = "https://github.com/NextGenConf/ApiGateway"
      - topics             = [] -> null
    }

  # github_repository.repository_conference_service will be updated in-place
  ~ resource "github_repository" "repository_conference_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "Microservice for storing conferences"
        etag               = "W/\"4a9f0e6b951aadc25ccd7ff657751530\""
        full_name          = "NextGenConf/ConferenceService"
        git_clone_url      = "git://github.com/NextGenConf/ConferenceService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ConferenceService"
        http_clone_url     = "https://github.com/NextGenConf/ConferenceService.git"
        id                 = "ConferenceService"
        name               = "ConferenceService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ConferenceService.git"
        svn_url            = "https://github.com/NextGenConf/ConferenceService"
      - topics             = [] -> null
    }

  # github_repository.repository_conference_session_service will be updated in-place
  ~ resource "github_repository" "repository_conference_session_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing the relationship between conferences and sessions"
        etag               = "W/\"c0ba6315830efc070993b3683ef17c0a\""
        full_name          = "NextGenConf/ConferenceSessionService"
        git_clone_url      = "git://github.com/NextGenConf/ConferenceSessionService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ConferenceSessionService"
        http_clone_url     = "https://github.com/NextGenConf/ConferenceSessionService.git"
        id                 = "ConferenceSessionService"
        license_template   = "mit"
        name               = "ConferenceSessionService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ConferenceSessionService.git"
        svn_url            = "https://github.com/NextGenConf/ConferenceSessionService"
      - topics             = [] -> null
    }

  # github_repository.repository_feed_service will be updated in-place
  ~ resource "github_repository" "repository_feed_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing conference feeds"
        etag               = "W/\"5619e6462868664e70fee0230f3a9a85\""
        full_name          = "NextGenConf/FeedService"
        git_clone_url      = "git://github.com/NextGenConf/FeedService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/FeedService"
        http_clone_url     = "https://github.com/NextGenConf/FeedService.git"
        id                 = "FeedService"
        license_template   = "mit"
        name               = "FeedService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/FeedService.git"
        svn_url            = "https://github.com/NextGenConf/FeedService"
      - topics             = [] -> null
    }

  # github_repository.repository_k8s_config will be updated in-place
  ~ resource "github_repository" "repository_k8s_config" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Repository containing the kubernetes resource files for the NextGenConf cluster"
        etag               = "W/\"698544ee4993fcf618f12cd5b3884d43\""
        full_name          = "NextGenConf/KubeConfig"
        git_clone_url      = "git://github.com/NextGenConf/KubeConfig.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/KubeConfig"
        http_clone_url     = "https://github.com/NextGenConf/KubeConfig.git"
        id                 = "KubeConfig"
        license_template   = "mit"
        name               = "KubeConfig"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/KubeConfig.git"
        svn_url            = "https://github.com/NextGenConf/KubeConfig"
    }

  # github_repository.repository_session_service will be updated in-place
  ~ resource "github_repository" "repository_session_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing conference sessions"
        etag               = "W/\"2e60dad2b4bbb953d19a64df6a02a2c9\""
        full_name          = "NextGenConf/SessionService"
        git_clone_url      = "git://github.com/NextGenConf/SessionService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/SessionService"
        http_clone_url     = "https://github.com/NextGenConf/SessionService.git"
        id                 = "SessionService"
        license_template   = "mit"
        name               = "SessionService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/SessionService.git"
        svn_url            = "https://github.com/NextGenConf/SessionService"
      - topics             = [] -> null
    }

  # github_repository.repository_web_app will be updated in-place
  ~ resource "github_repository" "repository_web_app" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "React app displaying conferences"
        etag               = "W/\"1988229731299f8d00fad0cf502779df\""
        full_name          = "NextGenConf/WebApp"
        git_clone_url      = "git://github.com/NextGenConf/WebApp.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/WebApp"
        http_clone_url     = "https://github.com/NextGenConf/WebApp.git"
        id                 = "WebApp"
        name               = "WebApp"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/WebApp.git"
        svn_url            = "https://github.com/NextGenConf/WebApp"
      - topics             = [] -> null
    }

Plan: 1 to add, 7 to change, 0 to destroy.
```

</details>

*Workflow: `ci pr`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
